{
  "site": {
    "themeName": "Default",
    "feedEnabled": true,
    "feedLength": 10,
    "custom": {
      "Default": {
        "siteName": "haru"
      }
    }
  },
  "github": {
    "userName": "itsharu11",
    "email": "itsharu.dev@gmail.com",
    "repositoryName": "https://github.com/itsharu11/Blog",
    "branch": "master"
  },
  "articles": [
    {
      "published": true,
      "noteId": "2c1e5305f0a94849a37add736351d37a",
      "createdAt": 1692594600939,
      "updatedAt": 1692609027480,
      "tags": [],
      "content": "# Damn Vulnerable Web Application (DVWA) is a PHP/MySQL web application that is damn vulnerable. Its main goal is to be an aid for security professionals to test their skills and tools.\n\n## Step 1: Pre-Requisites for installing DVWA\n</br>\n\n## Updating the system\n\n```bash\nsudo apt update\n```\n\n## Upgrading the sysytem\n\n``` bash\nsudo apt upgrade\n```\n\nStep 1: Download Damn Vulnerable Web Application (DVWA)\n```bash\ncd /var/www/html\n```\n\n![986cb279ff0619878dc7243fc06f1af4.png](:/bd916fb0211947e38da0516dc322258b)\n\nOnce in this directory, we will clone the [DVWA GitHub repository](https://github.com/digininja/DVWA) with the command below.\n\n```bash\nsudo git clone https://github.com/digininja/DVWA\n```\n\n![617a16143380e72350dd57c9d8aecdac.png](:/97fb75794f184c37b195da614ea883be)\n\nAfter cloning, we can rename the DVWA folder to dvwa. That is not mandatory, but it makes work easier when executing multiple commands.\n\n![f16baf04072000fa0302a883635dacaf.png](:/f26851b7fe094e45abd45ce21c660570)\n***\n## Step 2: Configure DVWA\n\nAfter downloading cloning DVWA in our /var/www/html directory, we still need to do some minor configurations. To get started, let’s set read, write, and execute permissions to the DVWA directory. Execute the command below.\n\n![18c2a109c999f4e5f56eab5a79af30da.png](:/d0f65fdb30da4e48b8eb246a7a2cfada)\n\n\nAfter successfully executing the command, we need to set up the user and password required to access the database. Change directory to point to the config directory with the command below.\n\n![995e0b38b30719edd272c09e7c301dd3.png](:/a63cd0df04b54010b354b20f37bd1e56)\n\nWhen you run the ls command to view the files inside the directory, you will see the config.inc.php.dist file. That is the original file containing the default configurations. We won’t edit it. Instead, we will create a copy of this file called config.inc.php and the original config.inc.php.dist file will act as our backup in case things go wrong.\n\nExecute the command below.\n\n![adc8be328c54eee5e6ea484339bb82bf.png](:/a0790a0e10484ce0bb595b83026054c3)\n\nRun the command below to open the newly created file with `vim` editor and make the necessary changes, as shown in the image below. We will set `db_user` as user and `db_password` as pass. Feel free to use a different username or password.\n\n![9a5b409ad5585b4423857bf237a48a70.png](:/cd444876b12c4ee095e00d640bd6cf5c)\n\nSave the file (:wq, then Enter). That’s it! We are done configuring the DVWA Web application. Let’s move on and configure the database (MySQL).\n***\n## Step 3: Install MySQL on Kali Linux\nBy default, MySQL comes pre-installed on Kali Linux. If that's not the case for you or maybe you messed up with MySQL, we can go ahead and install it manually. If you have worked with Debian-based distributions, MySQL comes in two packages:\n\n    mysql-server\n  mysql-client\n\nIn our case, we will need to install the mysql-server. However, there is a catch. If you try using the command apt install mysql-server you will most likely get the error \"Package mysql-server is not available, but is referred to by another package. E: Package 'mysql-server' has no installation candidate.\" That's because the package mysql-server is referred to default-mysql-server in Kali Linux and also in the latest release of Debian (Debian 10). Therefore, use the command below:\n\n```bash\nsudo apt install default-mysql-server\n```\n\n***\n## Step 4: Configure MySQL Database\n\nStart the Mysql service with the command below:\n\n```bash\nsudo service mysql start\n```\n\nYou can check whether the service is running using the systemctl status command below.\n\n```bash\nsystemctl status mysql\n```\n\n![ed0e29940c0a78d29048eb48b7f1cb7a.png](:/2eb2729843b14614b5880bda46e58a26)\n\nLogin to the MySQL database using the command below as root. If you have another name set for the superuser in your system, use it instead of root.\n\n```bash\nsudo mysql -u root -p\n```\n\n![0ed1282640bd9b3274b63ce68543de8c.png](:/07341f8be5d24a10a4b86be1105d072c)\n\nWe will create a new user with the username and password set in our DVWA application configuration file. In my case, the username was ‘user,' and the password was ‘pass.’ The server we are using is Localhost (127.0.0.1). Use the command below.\n\n```sql\ncreate user 'user'@'127.0.0.1' identified by 'pass';\n```\n\n![9a1a57d21fa93c47dfa0f50b75939e6a.png](:/333b16d08f6f44258dbbe5346de5b875)\n\nWe need to grant this new user privilege over the dvwa database. Execute the command below.\n\n```sql\ngrant all privileges on dvwa.* to 'user'@'127.0.0.1' identified by 'pass';\n```\n\nUp to this point, we are through with configuring both the DVWA application and the MySQL database. Type exit to close the database.\n\n![dab62c9b7db99ef25e2a87e804d10d18.png](:/1ddc085a0e21497b89dd70424799127f)\n***\n## Step 5: Install PHP\n\nPHP comes installed in Kali Linux. However, if you want to install a particular version, you can do it manually from the Terminal. In this post, we will install PHP 8.2 which is the latest release as of writing this post. Follow the steps below.\n\nFirst, update your system and add the SURY PHP PPA repository by executing the commands below.\n\n```bash\nsudo apt update\nsudo apt -y install lsb-release apt-transport-https ca-certificates\nsudo wget -O /etc/apt/trusted.gpg.d/php.gpg https://packages.sury.org/php/apt.gpg\necho \"deb https://packages.sury.org/php/ buster main\" | sudo tee /etc/apt/sources.list.d/php.list\n```\n\nAfter successfully adding the repository, use the command below to install PHP 8.2\n\n```\nsudo apt update\nsudo apt install php8.2 -y\n```\n\nTo install additional PHP extensions, use the syntax below where xxx stands for the extension name.\n\n```\nsudo apt install php8.2-xxx\ne.g\nsudo apt install php8.2-{cli,json,imap,bcmath,bz2,intl,gd,mbstring,mysql,zip}\n\n```\n\n***\n##  Step 6: Configure Apache Server \n\nNow, we need to configure the server. Use the command below to change your location on the Terminal to point to /etc/php/8.2/apache2 directory.\n\n```bash\ncd /etc/php/8.2/apache2\n```\n\n![8dc0b42148e990f24dded155a1646faf.png](:/1f516583e80041c2820907e1fdbb34f6)\n\nIn the /etc/php/8.2/apache2, when you execute the ls command, you will see a file called php.ini. That is the file we will edit to configure our localhost server. Use the command below to open it using the `vim` editor.\n\n```\nsudo vim php.ini\n```\n\nScroll down and look for these two lines: allow_url_fopen and allow_url_include. Set them both as On. Save the file (:wq, then Enter).\n\n![8e98abb3df6b991385fac554692fc6c4.png](:/bb2d3231704d4fc58d6ef017c5aafe52)\n\nStart Apache server using the command below:\n\n```bash\nsudo service apache2 start\n```\n\nTo check whether the service started successfully, use the status command.\n\n```bash\nsystemctl status apache2\n```\n\n![89e11b9fe2a1fa501d447ee72e976ad6.png](:/d52d2c7d2347419ebd76b1f397b6666e)\n\n***\n## Step 7: Access DVWA on Your Browser\n\nThat’s it! We now have everything configured, and we can proceed to launch DVWA. Open your browser and enter the URL:\n\n```\nhttp://localhost/dvwa/setup.php\n```\n\n![43a2584a42d354d6424a9075ffcc919a.png](:/81af4cd0db0f4ccbaf3e4b4cd9feda9b)\n\nYou might see the errors colored in red as in the image above. Don’t panic! Scroll down and click the Create / Reset Database button.\n\nThat will create and configure the database. After some time, you will be redirected to the DVWA login page. Log in with these credentials:\n\n    Username - admin\n  Password - password\n\n![42d6e7c37cb2ea386748798644ae04d7.png](:/3a665c3403674d9aabf90da846698efd)\n\nOnce logged in, you will see the DVWA main page. On the left panel, we have the different types of attacks you can exploit and the DVWA Security button that allows you to choose the desired security level - Low, Medium, High, or Impossible.\n\n![762fc59949ab5e54b240bf173cc0fc7b.png](:/3a578ac9f1ce4e2aa5b61c3bdaa53f5a)\n\nThat is how we install DVWA on Kali Linux.",
      "url": "dvwa",
      "title": "DVWA"
    }
  ]
}